sengeiou/TTGO_Watch/ESP32_EPD/edp4in_driver.cpp
#include "EPD4IN_driver.h"
// #include "PIC.H"   ---dx
#include "SPIFFS.h"

#include <esp32-hal-dac.h>

String waveformbin = "/waveform.bin";
String ecodebin = "/ecode.bin";
String fontname;
SPIClass *hspi = NULL;
static const int spiClk = 15000000; // 15 MHz
unsigned char UNICODEbuffer[200];
struct pl_area epd_area;
struct font_type Epd_Font;
//配置显示字体
//
File f ;
void EPD4INC::EPD_SetFount( FONT font_index)
{
  f.close();
  switch (font_index)
  {
    case 0: Epd_Font.Fontname_En = "/fonten12.bin";       Epd_Font.Fontname_Cn = "/fontcn12.bin";   f = SPIFFS.open(Epd_Font.Fontname_Cn, "r");   Epd_Font.cn_px = 12; Epd_Font.cn_py = 12; Epd_Font.en_px = 6; Epd_Font.en_py = 12; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 0; break;
    case 1: Epd_Font.Fontname_En = "/fonten8.bin";       Epd_Font.Fontname_Cn = "/fontcn8.bin";     f = SPIFFS.open(Epd_Font.Fontname_Cn, "r");   Epd_Font.cn_px = 8; Epd_Font.cn_py = 8; Epd_Font.en_px = 4; Epd_Font.en_py = 8; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 1; break;
//  case 2: Epd_Font.Fontname_En = "/fonten15.bin";       Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 15; Epd_Font.cn_py = 15; Epd_Font.en_px = 8; Epd_Font.en_py = 15; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 2; break;
    case 3: Epd_Font.Fontname_En = "/fonten16.bin";       Epd_Font.Fontname_Cn = "/fontcn16.bin";   f = SPIFFS.open(Epd_Font.Fontname_Cn, "r");   Epd_Font.cn_px = 16; Epd_Font.cn_py = 16; Epd_Font.en_px = 8; Epd_Font.en_py = 16; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 3; break;
    case 4: Epd_Font.Fontname_En = "/fonten24.bin";       Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 24; Epd_Font.cn_py = 24; Epd_Font.en_px = 24; Epd_Font.en_py = 24; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 4; break;
    case 5: Epd_Font.Fontname_En = "/fonten32.bin";       Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 32; Epd_Font.cn_py = 32; Epd_Font.en_px = 32; Epd_Font.en_py = 32; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 5; break;
    case 6: Epd_Font.Fontname_En = "/fontnum16.bin";      Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 8; Epd_Font.cn_py = 16;   Epd_Font.en_px = 8; Epd_Font.en_py = 16; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 6; break;
    case 7: Epd_Font.Fontname_En = "/fontnum32.bin";      Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 16; Epd_Font.cn_py = 32;   Epd_Font.en_px = 16; Epd_Font.en_py = 32; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 7; break;
    case 8: Epd_Font.Fontname_En = "/dx_fontnum48.bin";      Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 24; Epd_Font.cn_py = 48;   Epd_Font.en_px = 24; Epd_Font.en_py = 48; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 8; break;
    case 9: Epd_Font.Fontname_En = "/fontnum64.bin";      Epd_Font.Fontname_Cn = "\0";              f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 32; Epd_Font.cn_py = 64;   Epd_Font.en_px = 32; Epd_Font.en_py = 64; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 9; break;


    case 10: Epd_Font.Fontname_En = "/icon12.bin";    Epd_Font.Fontname_Cn = "\0";               f = SPIFFS.open(Epd_Font.Fontname_En, "r");     Epd_Font.cn_px = 0; Epd_Font.cn_py = 0;    Epd_Font.en_px = 12; Epd_Font.en_py = 12; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 10; break;
    case 11: Epd_Font.Fontname_En = "/icon16.bin";    Epd_Font.Fontname_Cn = "\0";               f = SPIFFS.open(Epd_Font.Fontname_En, "r");    Epd_Font.cn_px = 0; Epd_Font.cn_py = 0;    Epd_Font.en_px = 16; Epd_Font.en_py = 16; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 11; break;
    case 12: Epd_Font.Fontname_En = "/icon32.bin";    Epd_Font.Fontname_Cn = "\0";               f = SPIFFS.open(Epd_Font.Fontname_En, "r");    Epd_Font.cn_px = 0; Epd_Font.cn_py = 0;    Epd_Font.en_px = 32; Epd_Font.en_py = 32; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 12; break;
    case 13: Epd_Font.Fontname_En = "/icon48.bin";    Epd_Font.Fontname_Cn = "\0";               f = SPIFFS.open(Epd_Font.Fontname_En, "r");   Epd_Font.cn_px = 0; Epd_Font.cn_py = 0;    Epd_Font.en_px = 48; Epd_Font.en_py = 48; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 13; break;
    case 14: Epd_Font.Fontname_En = "/icon64.bin";    Epd_Font.Fontname_Cn = "\0";               f = SPIFFS.open(Epd_Font.Fontname_En, "r");  Epd_Font.cn_px = 0; Epd_Font.cn_py = 0;    Epd_Font.en_px = 64; Epd_Font.en_py = 64; Epd_Font.part_dx = 1; Epd_Font.Font_Index = 14; break;


  }

}
  int SPIstatus = 0;      //如果休眠 ，变量会复位位0.表示需要重新初始化
//初始化端口 
void  EPD4INC::EPD4INC_Port_init(void)
{
  SPIstatus=1;;
  hspi = new SPIClass(HSPI);
  //initialise hspi with default pins
  //SCLK = 14, MISO = 12, MOSI = 13, SS = 15
  hspi->beginTransaction(SPISettings(spiClk, MSBFIRST, SPI_MODE0));
  hspi->begin();
  hspi->beginTransaction(SPISettings(spiClk, MSBFIRST, SPI_MODE0));
  Serial.println("HSPI Init OK");
  //alternatively route through GPIO pins
  //hspi->begin(25, 26, 27, 32); //SCLK, MISO, MOSI, SS
  pinMode(SPICS_Pin, OUTPUT); //HSPI SS
  pinMode(EN3P3_Pin, OUTPUT); //HSPI SS
  pinMode(NRST_Pin, OUTPUT); //HSPI SS
 
  pinMode(SHDN_Pin, OUTPUT); //HSPI SS
  digitalWrite(EN3P3_Pin, HIGH);
  digitalWrite(NRST_Pin, HIGH);
  digitalWrite(SHDN_Pin, LOW);

  digitalWrite(SPICS_Pin, 1);

}


void  EPD4INC::EPD4INC_Port_Reinit(void)
{
  


  if(SPIstatus==0){ 
  hspi = new SPIClass(HSPI);
  //initialise hspi with default pins
  //SCLK = 14, MISO = 12, MOSI = 13, SS = 15
  hspi->beginTransaction(SPISettings(spiClk, MSBFIRST, SPI_MODE0));
  hspi->begin();
  hspi->beginTransaction(SPISettings(spiClk, MSBFIRST, SPI_MODE0));
  
  Serial.println("HSPI ReInit OK");

  
 
  pinMode(SPICS_Pin, OUTPUT); //HSPI SS
  pinMode(EN3P3_Pin, OUTPUT); //HSPI SS
 
  pinMode(SHDN_Pin, OUTPUT); //HSPI SS

  pinMode(HDC_Pin, OUTPUT); //HSPI SS


  digitalWrite(EN3P3_Pin, HIGH);
  pinMode(NRST_Pin, OUTPUT); //HSPI SS
  digitalWrite(NRST_Pin, HIGH);
    
  digitalWrite(SHDN_Pin, LOW);

  digitalWrite(SPICS_Pin, 1);
  }

  
