sengeiou/TTGO_Watch/ESP32_EPD/edp4in_driver.cpp
}

//启动3V3供电 长供电，无需使用本函数
int EPD4INC::EPD4INC_Power_up( void)
{
  dacWrite(25,110);
 
  digitalWrite(EN3P3_Pin, LOW);
  digitalWrite(NRST_Pin, LOW);
  //  digitalWrite(WKUP_Pin, HIGH);   //屏蔽即表示 停止时钟
  digitalWrite(SHDN_Pin, HIGH);
 }
//恢复3V3供电，长供电无需使用本函数
 int EPD4INC::EPD4INC_Power_ReUp( void)
{
  dacWrite(25,140);
  digitalWrite(EN3P3_Pin, LOW);
  digitalWrite(SHDN_Pin, HIGH);
}
//3V3掉电
int EPD4INC::EPD4INC_Power_down( void)
{
  digitalWrite(EN3P3_Pin, HIGH);
  digitalWrite(NRST_Pin, LOW);
  //  digitalWrite(WKUP_Pin, LOW);
  digitalWrite(SHDN_Pin, LOW);
 
}
//sleep 高压断电
int EPD4INC::EPD4INC_Power_Sleep( void)
{
  //  digitalWrite(EN3P3_Pin, LOW);
  //  digitalWrite(NRST_Pin, LOW);
  //  digitalWrite(WKUP_Pin, LOW);
//  digitalWrite(SHDN_Pin, LOW);
  

}
//
int EPD4INC::EPD4INC_Power_wakeup( void)
{
// digitalWrite(SHDN_Pin, HIGH);
  digitalWrite(EN3P3_Pin, LOW);
 
}
int EPD4INC::EPD4INC_HVEN( void)
{
  pinMode(SHDN_Pin, OUTPUT); 
  dacWrite(25,100);
  digitalWrite(SHDN_Pin, HIGH);
}
int EPD4INC::EPD4INC_HVDISEN( void)
{
 digitalWrite(SHDN_Pin, LOW);
}
int EPD4INC::UTFtoUNICODE(unsigned char *code)
{
  int i = 0; int charcount = 0;
  while (code[i] != '\0')
  {
    //Serial.println("current codei");
    //Serial.println(code[i],HEX);
    //  Serial.println(code[i]&0xf0,HEX);
    if (code[i] <= 0x7f) //ascii
    {

      UNICODEbuffer[charcount * 2] = 0x00;
      UNICODEbuffer[charcount * 2 + 1] = code[i];
      // Serial.println("english or number");
      // Serial.println(UNICODEbuffer[charcount*2],HEX);
      //  Serial.println(UNICODEbuffer[charcount*2+1],HEX);
      i++; charcount++;

    }
    else if ((code[i] & 0xe0) == 0xc0)
    {

      UNICODEbuffer[charcount * 2 + 1] = (code[i] << 6) + (code[i + 1] & 0x3f);
      UNICODEbuffer[charcount * 2] = (code[i] >> 2) & 0x07;
      i += 2; charcount++;
      // Serial.println("two bits utf-8");
    }
    else if ((code[i] & 0xf0) == 0xe0)
    {

      UNICODEbuffer[charcount * 2 + 1] = (code[i + 1] << 6) + (code[i + 2] & 0x7f);
      UNICODEbuffer[charcount * 2] = (code[i] << 4) + ((code[i + 1] >> 2) & 0x0f);

      //Serial.println("three bits utf-8");
      // Serial.println(UNICODEbuffer[charcount*2],HEX);
      // Serial.println(UNICODEbuffer[charcount*2+1],HEX);
      i += 3; charcount++;
    }
    else
    {
      return 0;
    }
  }
  UNICODEbuffer[charcount * 2] = '\0';
  return charcount * 2;
}


//在指定位置显示unicode
//参数 X Y 坐标   字符数据（2字节） 是否反相
uint16_t EPD4INC::DrawUnicodeChar(int16_t x, int16_t y,  unsigned char *code, unsigned char isinv)
{

  int charcode, offset;
  int sizeofsinglechar;
  String fontname;
  epd_area.top = y;
  epd_area.left = x;
  charcode = (code[0] * 0x100 + code[1]);

 
  epd_area.height = Epd_Font.cn_py;
  epd_area.width =  Epd_Font.cn_px;

  if ( epd_area.height % 8 == 0)
    sizeofsinglechar = ( epd_area.height / 8) * epd_area.width;
  else
    sizeofsinglechar = ( epd_area.height / 8 + 1) * epd_area.width ;
  offset = charcode * sizeofsinglechar;
  fontname = Epd_Font.Fontname_Cn;
  
  char fontbuf[sizeofsinglechar];
 
  
  f.seek(offset, SeekSet);
  f.readBytes(fontbuf, sizeofsinglechar);


  
  // f.close();
  //  Serial.print("\nDrawUnicodeChar load font data over \n");
  User_Font_Tran((uint16_t)sizeofsinglechar, (uint8_t*)fontbuf, S1D13541_LD_IMG_1BPP, &epd_area, isinv);
  //int EPD4INC::User_Img_Tran(uint16_t height, uint16_t width, const  uint8_t* p_img, uint16_t mode, const struct pl_area *area, uint8_t isinv)
  //SPIFFS.end();

  if ((charcode < 0x80) && (Epd_Font.Font_Index < 6)) //字库种英文字符为方块，此处更新
  {
    epd_area.height = Epd_Font.en_py;
    epd_area.width =  Epd_Font.en_px;
  }


  return epd_area.width;  //返回操作数据宽度，便于下一个字符处理
}
//在指定位置显示unicode
//参数 X Y 坐标   字符数据（2字节） 是否反相
int EPD4INC::DrawUnicodeStr(int16_t x, int16_t y, uint16_t strle,  unsigned char *code, unsigned char isinv)
{

  int i = 0;
  int locat = 0, locatreturn;
  for (i = 0; i < strle / 2; i++)
  {
    locatreturn = DrawUnicodeChar(x + locat, y, code, isinv);
    locat += locatreturn;
    code += 2;
  }
  return locat;
}
void EPD4INC::DrawUTF(int16_t x, int16_t y, String code, unsigned char isinv)
{
  char buffer[200];
  code.toCharArray(buffer, 200);
  DrawUTF(x, y, (unsigned char *)buffer, isinv);
}
void EPD4INC::DrawUTF(int16_t x, int16_t y, unsigned char *code, unsigned char isinv)
{
  int charcount;
  charcount = UTFtoUNICODE((unsigned char*)code);
  //  Serial.printf("\n DrawUTF charcount is%d\n",charcount);   //字符长度
  DrawUnicodeStr(x, y, charcount, (unsigned char *)UNICODEbuffer, isinv);

}
void EPD4INC::DrawTime(int16_t x, int16_t y, uint16_t hour, uint16_t minute, FONT font_index, unsigned char isinv)
{ //12:12
  FONT font_back = font_index;
  uint16_t widthback;
  unsigned char timebuf[10];  //

  timebuf[0] = 0;
  timebuf[1] = hour / 10;
  timebuf[2] = 0;
  timebuf[3] = hour % 10;
  timebuf[4] = 0;
  timebuf[5] = 10;
  timebuf[6] = 0;
  timebuf[7] = minute / 10;
  timebuf[8] = 0;
  timebuf[9] = minute % 10;
  EPD_SetFount( font_index);    //设置字体 设置数码管字体
  DrawUnicodeStr( x, y, 10, timebuf, isinv);
  EPD_SetFount( font_back);     //恢复字体
}



//private
int EPD4INC:: epson_epdc_clear_init()
{
  return s1d135xx_clear_init();
}
int EPD4INC::epson_epdc_wait_update_end()
{
  return s1d135xx_wait_update_end();
}
int EPD4INC::epson_epdc_set_power(enum pl_epdc_power_state state)
{
  if (s1d135xx_set_power_state(state))
    return -1;
  return 0;
}
int EPD4INC::epson_epdc_set_epd_power(int on)
{
  return s1d135xx_set_epd_power(on);
}
int EPD4INC::epson_epdc_init()
{

  if (epson_epdc_init_s1d13541())
    return -1;

  if (s1d13541_load_wflib())
    return -1;
  return 0;
}
int EPD4INC::epson_epdc_early_init()
{
  return epson_epdc_early_init_s1d13541();
}



void EPD4INC::s1d135xx_hard_reset()
{
  digitalWrite(NRST_Pin, LOW);
  delay(4);
  digitalWrite(NRST_Pin, HIGH);
  delay(10);
}

int EPD4INC::s1d135xx_soft_reset()
{
  s1d135xx_write_reg(S1D135XX_REG_SOFTWARE_RESET, 0xFF);
  return 0;
}

int EPD4INC::s1d135xx_check_prod_code(uint16_t ref_code)
{
  uint16_t prod_code;

  prod_code = s1d135xx_read_reg(S1D135XX_REG_REV_CODE);

  do {
    prod_code = s1d135xx_read_reg(S1D135XX_REG_REV_CODE);
    Serial.println("prod_code:0x");
    Serial.print(prod_code, HEX);
  } while (prod_code != ref_code);


  if (prod_code != ref_code) {
    return -1;
  }

