sengeiou/TTGO_Watch/ESP32_EPD/edp4in_driver.cpp
  return 0;
}

int EPD4INC:: transfer_file(File *file)
{
  char databuf[DATA_BUFFER_LENGTH];
  int filesize = file->size();
  if (filesize < 0)
    return -1;
  for (int i = 0; i < (filesize / DATA_BUFFER_LENGTH); i++)
  {
    file->readBytes(databuf, DATA_BUFFER_LENGTH);
    transfer_data((uint8_t*)databuf, DATA_BUFFER_LENGTH);
  }
  file->readBytes(databuf, filesize % DATA_BUFFER_LENGTH);
  transfer_data((uint8_t*)databuf, filesize % DATA_BUFFER_LENGTH);

  return 0;
}

int EPD4INC::s1d135xx_load_init_code()
{
  uint16_t checksum;
  int stat;
  Serial.print("\nload ecobin data star \n");
  File f = SPIFFS.open(ecodebin, "r");
  if (s1d135xx_wait_idle())
    return -1;
  set_cs(0);
  send_cmd(S1D135XX_CMD_INIT_SET);
  stat = transfer_file(&f);
  //  transfer_data(initdata1, sizeof(initdata1));
  set_cs(1);
  f.close();
  Serial.print("\nload ecobin data over \n");
  if (s1d135xx_wait_idle())
    return -1;
  set_cs(0);
  send_cmd(S1D135XX_CMD_INIT_STBY);
  send_param(0x0500);
  set_cs(1);
  delay(10);
  if (s1d135xx_wait_idle())
    return -1;
  checksum = s1d135xx_read_reg(S1D135XX_REG_SEQ_AUTOBOOT_CMD);

  if (!(checksum & (uint16_t)S1D135XX_INIT_CODE_CHECKSUM_OK)) {
    return -1;
  }

  return 0;
}

int EPD4INC::s1d135xx_load_wflib(uint32_t size, uint32_t addr)
{
  uint16_t params[4];

  Serial.print("\nload waveformbin data star \n");
  File f = SPIFFS.open(waveformbin, "r");

  uint32_t size2 = f.size() / 2;
  if (s1d135xx_wait_idle())
    return -1;
  params[0] = addr & 0xFFFF;
  params[1] = (addr >> 16) & 0xFFFF;
  params[2] = size2 & 0xFFFF;
  params[3] = (size2 >> 16) & 0xFFFF;
  set_cs(0);
  send_cmd(S1D135XX_CMD_BST_WR_SDR);
  send_params(params, 4);
  set_cs(1);

  // wflib_wr(waveform, sizeof(waveform));
  wflib_wr_file(&f);   

  if (s1d135xx_wait_idle())
    return -1;
  send_cmd_cs(S1D135XX_CMD_BST_END_SDR);
  f.close();

  Serial.print("\nload waveformbin data over \n");
  return s1d135xx_wait_idle();
}

int EPD4INC::s1d135xx_init_gate_drv()
{
  send_cmd_cs(S1D135XX_CMD_EPD_GDRV_CLR);

  return s1d135xx_wait_idle();
}

int EPD4INC::s1d135xx_wait_dspe_trig()
{
  send_cmd_cs(S1D135XX_CMD_WAIT_DSPE_TRG);

  return 0;
}

int  EPD4INC::s1d135xx_clear_init()
{
  send_cmd_cs(S1D135XX_CMD_UPD_INIT);

  return s1d135xx_wait_dspe_trig();
}

int EPD4INC::s1d135xx_fill(uint16_t mode, unsigned bpp, const struct pl_area *a, uint8_t grey)
{
  struct pl_area full_area;
  const struct pl_area *fill_area;

  set_cs(0);

  if (a != NULL) {
    send_cmd_area(S1D135XX_CMD_LD_IMG_AREA, mode, a);
    fill_area = a;
  } else {
    send_cmd(S1D135XX_CMD_LD_IMG);
    send_param(mode);
    full_area.top = 0;
    full_area.left = 0;
    full_area.width = 399;
    full_area.height = 239;
    fill_area = &full_area;
  }

  set_cs(1);

  return do_fill(fill_area, bpp, grey);
}

int EPD4INC::s1d135xx_pattern_check(uint16_t height, uint16_t width, uint16_t checker_size, uint16_t mode)
{
  uint16_t i = 0, j = 0, k = 0;
  uint16_t val = 0;

  set_cs(0);
  send_cmd(S1D135XX_CMD_LD_IMG);
  send_param(mode);
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;

  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);

 // transfer_data(gImage_PIC, 48000);

  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;
  send_cmd_cs(S1D135XX_CMD_LD_IMG_END);

  return 0;
}


int EPD4INC::s1d135xx_update(int wfid, enum pl_update_mode mode,  const struct pl_area *area)
{
  //  struct pl_area area_scrambled;
  uint8_t command = S1D135XX_CMD_UPDATE_FULL + mode;
  set_cs(0);

  /* wfid = S1D135XX_WF_MODE(wfid); */

  if (area != NULL) {
    if (!(command % 2 == 0))
      command++;

    send_cmd_area(command, S1D135XX_WF_MODE(wfid), area);

  } else {
    send_cmd(command);
    send_param(S1D135XX_WF_MODE(wfid));
  }

  set_cs(1);

  if (s1d135xx_wait_idle())
    return -1;

  return s1d135xx_wait_dspe_trig();
}

int EPD4INC::EPD4INC::s1d135xx_wait_update_end()
{
  send_cmd_cs(S1D135XX_CMD_WAIT_DSPE_FREND);

  return s1d135xx_wait_idle();
}

int EPD4INC::s1d135xx_wait_idle()
{
  unsigned long timeout = 100000;

  while (!get_hrdy() && --timeout);

  if (!timeout) {

    return -1;
  }

  return 0;
}


int EPD4INC::s1d135xx_set_power_state(enum pl_epdc_power_state state)
{
  int stat;

  set_cs(1);
  set_hdc(1);
  //  HAL_GPIO_WritePin(GPIOB, EN3P3_Pin, GPIO_PIN_SET);
  //  HAL_GPIO_WritePin(GPIOB, WKUP_Pin, GPIO_PIN_SET);

  switch (state) {
    case PL_EPDC_RUN:
      send_cmd_cs(S1D135XX_CMD_RUN);
      stat = s1d135xx_wait_idle();
      break;

    case PL_EPDC_STANDBY:
      send_cmd_cs(S1D135XX_CMD_STBY);
      stat = s1d135xx_wait_idle();
      break;

    case PL_EPDC_SLEEP:
      send_cmd_cs(S1D135XX_CMD_STBY);
      stat = s1d135xx_wait_idle();

      break;

    case PL_EPDC_OFF:
      send_cmd_cs(S1D135XX_CMD_SLEEP);
      stat = s1d135xx_wait_idle();

      set_hdc(0);
      set_cs(0);
      break;
  }

  return stat;
}

int EPD4INC::s1d135xx_set_epd_power(int on)
{
  uint16_t arg = on ? S1D135XX_PWR_CTRL_UP : S1D135XX_PWR_CTRL_DOWN;
  uint16_t tmp;

  s1d135xx_write_reg(S1D135XX_REG_PWR_CTRL, arg);

  do {
    tmp = s1d135xx_read_reg(S1D135XX_REG_PWR_CTRL);
  } while (tmp & S1D135XX_PWR_CTRL_BUSY);

  if (on && ((tmp & S1D135XX_PWR_CTRL_CHECK_ON) !=
             S1D135XX_PWR_CTRL_CHECK_ON)) {
    return -1;
  }
  return 0;
}

void EPD4INC::s1d135xx_cmd(uint16_t cmd, uint16_t *params, size_t n)
{
  set_cs(0);
  send_cmd(cmd);
  send_params(params, n);
  set_cs(1);
}

uint16_t EPD4INC::s1d135xx_read_reg(uint16_t reg)
{
  uint16_t val;

  set_cs(0);
  send_cmd(S1D135XX_CMD_READ_REG);
  send_param(reg);


  val = hspi->transfer16(0xffff);
  val = hspi->transfer16(0xffff);
  set_cs(1);

  return val;  // swap bytes after read
  //  return ((val<<8)&0xFF00) | ((val>>8)&0xFF);
}

void EPD4INC::s1d135xx_write_reg(uint16_t reg, uint16_t val)
{
  uint16_t params[] = { reg, val };

  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_params(params, 2);
  set_cs(1);
}


/* ----------------------------------------------------------------------------
   private functions
*/
#define S1D13541_STATUS_HRDY            (1 << 13)

int EPD4INC::get_hrdy()
{
  uint16_t status;
  status = s1d135xx_read_reg(S1D135XX_REG_SYSTEM_STATUS);

  return ((status & S1D13541_STATUS_HRDY) == S1D13541_STATUS_HRDY);
}

int EPD4INC::do_fill(const struct pl_area *area, unsigned bpp, uint8_t g)
{
  uint16_t val16;
  uint16_t lines;
  uint16_t pixels;

  /* Only 16-bit transfers for now... */
  //  assert(!(area->width % 2));

