sengeiou/TTGO_Watch/ESP32_EPD/edp4in_driver.cpp
  switch (bpp) {
    case 1:
    case 2:
      //    LOG("Unsupported bpp");
      return -1;
    case 4:
      val16 = g & 0xF0;
      val16 |= val16 >> 4;
      val16 |= val16 << 8;
      pixels = area->width / 4;
      break;
    case 8:
      val16 = g | (g << 8);
      pixels = area->width / 2;
      break;
    default:;
      //    assert_fail("Invalid bpp");
  }

  lines = area->height;

  if (s1d135xx_wait_idle())
    return -1;

  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);

  while (lines--) {
    uint16_t x = pixels;

    while (x--)
      send_param(val16);
  }

  set_cs(1);

  if (s1d135xx_wait_idle())
    return -1;

  send_cmd_cs(S1D135XX_CMD_LD_IMG_END);

  return s1d135xx_wait_idle();
}

int EPD4INC::wflib_wr(const uint8_t *data, size_t n)
{
  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);
  transfer_data(data, n);
  set_cs(1);

  return 0;
}
//增加文件读取  写入SPI
int EPD4INC::wflib_wr_file(File *file)
{
  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);
  transfer_file(file);

  set_cs(1);
  return 0;
}

void EPD4INC:: transfer_data(const uint8_t *data, size_t n)
{
  uint16_t *data16 = (uint16_t *)data;

  n /= 2;

  while (n--)
    send_param(*data16++);
}

void EPD4INC::send_cmd_area(uint16_t cmd, uint16_t mode,
                            const struct pl_area *area)
{
  uint16_t args[] = {
    mode,
    (area->left & S1D135XX_XMASK),
    (area->top & S1D135XX_YMASK),
    (area->width & S1D135XX_XMASK),
    (area->height & S1D135XX_YMASK),
  };
#if VERBOSE
  LOG("%s: Command: 0x%04X", __func__, cmd);
#endif
  send_cmd(cmd);
  send_params(args, 5);
}

void  EPD4INC::send_cmd_cs(uint16_t cmd)
{
  set_cs(0);
  send_cmd(cmd);
  set_cs(1);
}

void EPD4INC::send_cmd(uint16_t cmd)
{
  //  uint16_t cmd2 = ((cmd<<8)&0xFF00) | ((cmd>>8)&0xFF);
  //  cmd = htobe16(cmd); // swap bytes before writing
  set_hdc(0);
  //  p->interface->write((uint8_t *)&cmd, sizeof(uint16_t));
  //  HAL_SPI_Transmit(&hspi1, (uint8_t*)&cmd, 1, 0xff);
  //  hspi->transfer((char)(cmd>>8));
  //  hspi->transfer((char)(cmd&0xff00));

  hspi->transfer16(cmd);
  set_hdc(1);
}

void EPD4INC::send_params(uint16_t *params, size_t n)
{
  size_t i;

  for (i = 0; i < n; ++i)
    send_param(params[i]);
}

void EPD4INC::send_param(uint16_t param)
{


  hspi->transfer16(param);
  //  HAL_SPI_Transmit(&hspi1, (uint8_t*)&param, 1, 0xff);
}
void EPD4INC::set_cs(int state)
{
  if (state)  digitalWrite(SPICS_Pin, HIGH);
  if (!state) digitalWrite(SPICS_Pin, LOW);

}

void EPD4INC::set_hdc(int state)
{
  if (state) digitalWrite(HDC_Pin, HIGH);
  if (!state)digitalWrite(HDC_Pin, LOW);

}

int EPD4INC::set_init_rot_mode()
{
  set_cs(0);
  send_cmd(S1D135XX_CMD_INIT_ROT_MODE);
  send_param(0x0400);
  set_cs(1);
  delay(10);
  return s1d135xx_wait_idle();
}


int EPD4INC::s1d13541_load_wflib()
{
  //  struct s1d135xx *p = epdc->data;

  return s1d135xx_load_wflib(2, S1D13541_WF_ADDR);
}

int EPD4INC::s1d13541_set_temp_mode(enum pl_epdc_temp_mode mode)
{
  //  struct s1d135xx *p = epdc->data;
  uint16_t reg;

  //  if (mode == epdc->temp_mode)
  //    return 0;

  reg = s1d135xx_read_reg(S1D135XX_REG_PERIPH_CONFIG);
  /* ToDo: when do we set this bit back? */
  reg &= S1D13541_TEMP_SENSOR_CONTROL;

  switch (mode) {
    case PL_EPDC_TEMP_MANUAL:
      break;
    case PL_EPDC_TEMP_EXTERNAL:
      reg &= ~S1D13541_TEMP_SENSOR_EXTERNAL;
      break;
    case PL_EPDC_TEMP_INTERNAL:
      reg |= S1D13541_TEMP_SENSOR_EXTERNAL;
      break;
    default:;
      //    assert_fail("Invalid temperature mode");
  }

  s1d135xx_write_reg(S1D135XX_REG_PERIPH_CONFIG, reg);

  /* Configure the controller to automatically update the waveform table
     after each temperature measurement.  */
  reg = s1d135xx_read_reg(S1D13541_REG_WF_DECODER_BYPASS);
  reg |= S1D13541_AUTO_TEMP_JUDGE_EN;
  s1d135xx_write_reg(reg, S1D13541_REG_WF_DECODER_BYPASS);

  //  epdc->temp_mode = mode;

  return 0;
}

int EPD4INC::s1d13541_update_temp(enum pl_epdc_temp_mode temp_mode)
{
  //  struct s1d135xx *p = epdc->data;
  int stat;

  switch (temp_mode) {
    case PL_EPDC_TEMP_MANUAL:
      //    stat = update_temp_manual(epdc->manual_temp);
      break;
    case PL_EPDC_TEMP_EXTERNAL:
      stat = update_temp_auto(S1D135XX_REG_I2C_TEMP_SENSOR_VALUE);
      break;
    case PL_EPDC_TEMP_INTERNAL:
      stat = update_temp_auto(S1D13541_REG_TEMP_SENSOR_VALUE);
      break;
  }

  if (stat)
    return -1;


  return 0;
}

int EPD4INC::s1d13541_fill(const struct pl_area *area, uint8_t grey)
{
  return s1d135xx_fill(S1D13541_LD_IMG_8BPP, 8, area, grey);
}

int EPD4INC::s1d13541_pattern_check(uint16_t size)
{
  //return s1d135xx_pattern_check(240, 400, size, S1D13541_LD_IMG_8BPP);
  return s1d135xx_pattern_check(240, 400, size, S1D13541_LD_IMG_4BPP);
}
int EPD4INC::s1d13541_pattern_check_test_part(uint16_t size, const struct pl_area *area)
{

}
/* -- initialisation -- */
int EPD4INC::epson_epdc_early_init_s1d13541()
{
  int16_t measured_temp = -127;
  s1d135xx_hard_reset();

  if (s1d135xx_soft_reset())
    return -1;
  Serial.println("Check EPD ... ");
  if (s1d135xx_check_prod_code(S1D13541_PROD_CODE))
    return -1;

  return s1d13541_init_clocks();
}

int EPD4INC::epson_epdc_init_s1d13541()
{
  //  struct s1d135xx *p = epdc->data;

  if (epson_epdc_early_init_s1d13541())
    return -1;

  if (s1d135xx_load_init_code()) {
    return -1;
  }
  
  EPD_Set_Rota(3);

  // mg033 & mg034
  //s1d135xx_write_reg(p, 0x0140, 0);

  s1d135xx_write_reg(S1D13541_REG_PROT_KEY_1, S1D13541_PROT_KEY_1);
  s1d135xx_write_reg(S1D13541_REG_PROT_KEY_2, S1D13541_PROT_KEY_2);

  if (s1d135xx_wait_idle())
    return -1;

  if (s1d135xx_set_power_state(PL_EPDC_RUN))
    return -1;

  if (s1d135xx_init_gate_drv())
    return -1;

  if (s1d135xx_wait_dspe_trig())
    return -1;


  return s1d13541_set_temp_mode(PL_EPDC_TEMP_INTERNAL);
}

/* ----------------------------------------------------------------------------
   private functions
*/

