sengeiou/TTGO_Watch/ESP32_EPD/edp4in_driver.cpp
int EPD4INC::s1d13541_init_clocks()
{
  s1d135xx_write_reg(S1D135XX_REG_I2C_CLOCK, S1D13541_I2C_CLOCK_DIV);

  //此处配置晶振 如果为20Mhz时钟输入

  s1d135xx_write_reg(0x0014, 0x0080);
  s1d135xx_write_reg(0x0012, 0x9000);



  if (s1d135xx_wait_idle())
    return -1;



  s1d135xx_write_reg(S1D13541_REG_CLOCK_CONFIG, S1D13541_INTERNAL_CLOCK_ENABLE);
  return s1d135xx_wait_idle();
}
void EPD4INC::update_temp(uint16_t reg)
{
  uint16_t regval;

  regval = s1d135xx_read_reg(S1D135XX_REG_INT_RAW_STAT);
  //  p->flags.needs_update = (regval & S1D13541_INT_RAW_WF_UPDATE) ? 1 : 0;
  s1d135xx_write_reg(S1D135XX_REG_INT_RAW_STAT,
                     (S1D13541_INT_RAW_WF_UPDATE |
                      S1D13541_INT_RAW_OUT_OF_RANGE));
  regval = s1d135xx_read_reg(reg) & S1D135XX_TEMP_MASK;

}


int EPD4INC::update_temp_auto(uint16_t temp_reg)
{
  if (s1d135xx_set_power_state(PL_EPDC_STANDBY))
    return -1;

  s1d135xx_cmd(S1D13541_CMD_RD_TEMP, NULL, 0);

  if (s1d135xx_wait_idle())
    return -1;

  if (s1d135xx_set_power_state( PL_EPDC_RUN))
    return -1;

  update_temp(temp_reg);

  return 0;
}

int EPD4INC::s1d13541_read_prom(uint8_t * blob)
{
  int i = 0, j = 0;
  uint16_t data = 0;
  uint16_t addr_ = 0;

  // wait for status: idle
  if (wait_for_ack(S1D13541_PROM_STATUS_IDLE, 0xffff))
    return -1;

  for (i = 0; i < 8; i++)
  {
    for (j = 0; j < 2; j++)
    {
      // set read address
      addr_ = ((i * 2 + j) << 8) & 0x0f00;
      s1d135xx_write_reg(S1D13541_PROM_ADR_PGR_DATA, addr_);

      // set read operation start trigger
      s1d135xx_write_reg(S1D13541_PROM_CTRL, S1D13541_PROM_READ_START);

      //wait for status: read mode start
      if (wait_for_ack(S1D13541_PROM_STATUS_READ_MODE, S1D13541_PROM_STATUS_READ_MODE))
        return -1;

      //wait for status: read operation finished
      if (wait_for_ack(0x0000, S1D13541_PROM_STATUS_READ_BUSY))
        return -1;

      // set read operation start trigger
      data = s1d135xx_read_reg(S1D13541_PROM_READ_DATA);
      if (j)
        blob[i] |= data & 0x0f;
      else
        blob[i] = data << 4 & 0xf0;

    }
  }

  // set read mode stop trigger
  s1d135xx_write_reg(S1D13541_PROM_CTRL, S1D13541_PROM_READ_STOP);

  //wait for status: read mode stop
  if (wait_for_ack(0x0000, S1D13541_PROM_STATUS_READ_MODE))
    return -1;

  return 0;
}


int EPD4INC::wait_for_ack (uint16_t status, uint16_t mask)
{
  unsigned long timeout = 50000;
  uint16_t v;
  while ((v = s1d135xx_read_reg(S1D13541_PROM_STATUS) & mask) != status) {
    --timeout;
    v = v;
    if (timeout == 0) {
      //                     LOG("PROM acknowledge timeout");
      return -1;
    }
  }

  return 0;
}


int EPD4INC:: pl_epdc_single_update(int wfid, enum pl_update_mode mode, const struct pl_area *area)
{
  if (s1d13541_update_temp(PL_EPDC_TEMP_INTERNAL))
    return -1;

  s1d135xx_set_epd_power(1);
  //  if (psu->on(psu))
  //    return -1;

  if (s1d135xx_update(wfid, mode, area))
    return -1;

  if (s1d135xx_wait_update_end())
    return -1;

  s1d135xx_set_epd_power(0);
  //  return psu->off(psu);
  return 0;
}
//////////////////////////////////////////////////////////////
//
void  EPD4INC::transfer_data_inv(const uint8_t *data, size_t n)
{
  uint16_t *data16 = (uint16_t *)data;
  n /= 2;
  while (n--)
    send_param(~(*data16++));
}
//高 宽  图片地址  模式 S1D13541_LD_IMG_4BPP 等
//区域结构体
//最后一个参数，是否反色 ，部分显示需要反色的。
//用户图形发送，  高度 宽度  指针  模式  区域 是否反相显示
int EPD4INC::User_Img_Tran(uint16_t height, uint16_t width, const  uint8_t* p_img, uint16_t mode, const struct pl_area *area, uint8_t isinv)
{
  uint16_t i = 0, j = 0, k = 0;
  uint16_t val = 0;

  set_cs(0);
  send_cmd_area( S1D135XX_CMD_LD_IMG_AREA, mode, area);
  send_cmd(S1D135XX_CMD_LD_IMG);
  send_param(mode);
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;

  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);
  if (isinv == 1)
    transfer_data_inv(p_img, height * width);
  else
    transfer_data(p_img, height * width);

  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;
  send_cmd_cs(S1D135XX_CMD_LD_IMG_END);

  return 0;
}
//高 宽  图片地址  模式 S1D13541_LD_IMG_4BPP 等
//区域结构体
//最后一个参数，是否反色 ，部分显示需要反色的。
//用户图形发送，  高度 宽度  指针  模式  区域 是否反相显示
int EPD4INC::User_Font_Tran(uint16_t fontsize, const  uint8_t* p_img, uint16_t mode, const struct pl_area *area, uint8_t isinv)
{
  uint16_t i = 0, j = 0, k = 0;
  uint16_t val = 0;
  uint8_t charbuf[fontsize];
  if (Epd_Font.Font_Index == 0) //12#
  {
    for (i = 0; i < 6; i++)
    {
      charbuf[0 + i * 3] = p_img[0 + i * 4];
      charbuf[1 + i * 3] = (p_img[2 + i * 4] << 4) + (p_img[1 + i * 4] & 0x0F);
      charbuf[2 + i * 3] = (p_img[3 + i * 4] << 4) + (p_img[2 + i * 4] >> 4);
    }
    p_img = charbuf;
    fontsize = 18;
  }
 




  set_cs(0);
  send_cmd_area( S1D135XX_CMD_LD_IMG_AREA, mode, area);
  send_cmd(S1D135XX_CMD_LD_IMG);
  send_param(mode);
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;

  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);
  if (isinv == 1)
    transfer_data_inv(p_img, fontsize);
  else
    transfer_data(p_img, fontsize);

  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;
  send_cmd_cs(S1D135XX_CMD_LD_IMG_END);

  return 0;
}

//    pl_epdc_updateuser(2, UPDATE_PARTIAL_AREA, NULL);
//wfid 刷新方式 0 1 2 3
//mode  UPDATE_PARTIAL_AREA  FULL
//区域  可以NULL 因为在上传图片时已经指定了区域
//注意，多区域刷新可能引起重叠，解决方案是指定刷新区域，统一或者分别刷新
int EPD4INC::EPD_UpdateUser(int wfid, enum pl_update_mode mode, const struct pl_area *area)
{
  if (s1d13541_update_temp(PL_EPDC_TEMP_INTERNAL))
    return -1;
  s1d135xx_set_epd_power(1);
  //  if (psu->on(psu))
  //    return -1;
  if (s1d135xx_update(wfid, mode, area))
    return -1;
  return 0;
}
int EPD4INC::EPD_UpdateUserFast(int wfid, enum pl_update_mode mode, const struct pl_area *area)
{
 
  if (s1d135xx_update(wfid, mode, area))
    return -1;
  return 0;
}
int EPD4INC::EPD_Fill(uint16_t mode, const struct pl_area *area, uint8_t grey)
{
  return s1d135xx_fill(mode, 8, area, grey);

