sengeiou/TTGO_Watch/ESP32_EPD/edp4in_driver.cpp
}
//
//
////(240, 400, size, S1D13541_LD_IMG_4BPP);
//全屏幕传送 注意 mode 和size需要 匹配，1bpp 1200  2bpp2400  4bpp4800
//
int EPD4INC::EPD_Update_Full( uint16_t checker_size, uint16_t mode, const uint8_t *picimage)
{
  uint16_t i = 0, j = 0, k = 0;
  uint16_t val = 0;
  set_cs(0);
  send_cmd(S1D135XX_CMD_LD_IMG);
  send_param(mode);
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;
  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);
  transfer_data(picimage, checker_size);
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;
  send_cmd_cs(S1D135XX_CMD_LD_IMG_END);
  return 0;
}

//测试 发送空白数据
//区域定义，是否反相
//只操作缓存，不进行显示更新
int EPD4INC::EPD_Fill_White(const struct pl_area *area, uint8_t isinv)
{
  uint16_t i = 0, j = 0, k = 0;
  uint16_t val = 0;
  uint16_t n = ((area->width) * (area->height)) / 16;
  set_cs(0);
  send_cmd_area( S1D135XX_CMD_LD_IMG_AREA, S1D13541_LD_IMG_1BPP, area);
  send_cmd(S1D135XX_CMD_LD_IMG);
  send_param(S1D13541_LD_IMG_1BPP);
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;

  set_cs(0);
  send_cmd(S1D135XX_CMD_WRITE_REG);
  send_param(S1D135XX_REG_HOST_MEM_PORT);
  if (isinv == 1)
  {

    while (n--)
      send_param(0xFFFF);
  }
  else
  {
    while (n--)
      send_param(0);
  }
  set_cs(1);
  if (s1d135xx_wait_idle())
    return -1;
  send_cmd_cs(S1D135XX_CMD_LD_IMG_END);
  return 0;
}
void EPD4INC::EPD_CLK_EX(void)
{
  ledcSetup(0, 80000000, 1);
  ledcAttachPin(17, 0);  //GPIO 17 配置为20MHz输出
  ledcWrite(0, 1);
}
void EPD4INC::EPD_CLK_STOP(void)
{
    ledcDetachPin(17);
}
void EPD4INC::epd_read_reg(void)
{
 
  Serial.println("read reg 0x0010  12 14 16 is ");
  int regdata;
  regdata = s1d135xx_read_reg(0x0016);
  Serial.println(regdata);
  delay(20);
  regdata = s1d135xx_read_reg(0x0014);
  Serial.println(regdata);
  delay(20);
  regdata = s1d135xx_read_reg(0x0012);
  Serial.println(regdata);
  delay(20);
  regdata = s1d135xx_read_reg(0x0010);
  Serial.println(regdata);

}
//屏幕旋转角度  00  0   01  90   02 180  03 270
int EPD4INC::EPD_Set_Rota(uint8_t turnrota)
{

  uint16_t  regdata = s1d135xx_read_reg(S1D135XX_REG_MEM_ACCESS);
   Serial.println("Set Screen ROTA IS 90°");
  Serial.println((regdata&0xFCFF)|(turnrota<<8));

  s1d135xx_write_reg(S1D135XX_REG_MEM_ACCESS, (regdata&0xFCFF)|(turnrota<<8)); 
 
  return 0;
}

//以上为对屏幕DRAM操作。以下为对CPU内RAM操作。
void EPD4INC::Buf_SetPix(int16_t x, int16_t y)
{

  //    int16_t temp=x;
  //   x=y;y=YDOT-1-temp;
  if (x < XDOT && y < YDOT)  EPDbuffer[x / 8 + y * XDOT / 8] &= ~(0x01 << x % 8) ;


}
void EPD4INC::Buf_InverSePixel(int16_t x, int16_t y)
{
  //    int16_t temp=x;
  //   x=y;y=YDOT-1-temp;
  if (x < XDOT && y < YDOT) EPDbuffer[x / 8 + y * XDOT / 8] ^= (0x01 << x % 8) ;

}

//注意X和Y反转 ，适应屏幕需求
void EPD4INC::Buf_DrawLine(int ystart, int xstart, int yend, int xend)
{
  int dx = abs(xend - xstart); int dy = abs(yend - ystart);
  if (dx >= dy)
  {
    if (xend > xstart)
    {
      for (int i = xstart; i <= xend; i++)
      {
        Buf_SetPix(i, round((i - xstart) * (yend - ystart) / (xend - xstart)) + ystart);
      }
    }
    else
    {
      for (int i = xstart; i >= xend; i--)
      {
        Buf_SetPix(i, round((i - xstart) * (yend - ystart) / (xend - xstart)) + ystart);
      }

    }
  }

  else
  {
    if (yend > ystart)
    {
      for (int i = ystart; i <= yend; i++)
      {
        Buf_SetPix(round((i - ystart) * (xend - xstart) / (yend - ystart)) + xstart, i);
      }
    }
    else
    {
      for (int i = ystart; i >= yend; i--)
      {
        Buf_SetPix(round((i - ystart) * (xend - xstart) / (yend - ystart)) + xstart, i);
      }

    }
  }
}
void EPD4INC::Buf_Clear()
{
  for (int i = 0; i < (XDOT * YDOT / 8); i++) EPDbuffer[i] = 0xff;
}

void EPD4INC::Buf_InverseArea(int xStart, int xEnd, int yStart, int yEnd)
{
  for (int i = 0; i < (xEnd - xStart); i++)
  {
    for (int j = 0; j < (yEnd - yStart); j++)
    {
      Buf_InverSePixel(xStart + i, yStart + j);
    }

  }
}
void EPD4INC::Buf_DrawCircle(int x, int y, int r, bool fill)
{
  if (fill == 0)
  {
    for (int i = 0; i < 360; i++)
    {
      Buf_SetPix(round(cos(i)*r + x), round(sin(i)*r) + y);

    }
  }
  else
  {
    for (int j = 0; j < r; j++)
    {

      for (int i = 0; i < 360; i++)
      {
        Buf_SetPix(round(cos(i)*j + x), round(sin(i)*j) + y);

      }
    }
  }
}
void EPD4INC::Buf_Buf_DrawXline(int start, int end, int x)
{
  for (int i = start; i <= end; i++)
  {
    Buf_SetPix(i, x);
  }
}
void EPD4INC::Buf_Buf_DrawYline(int start, int end,  int y)
{
  for (int i = start; i <= end; i++)
  {
    Buf_SetPix(y, i);
  }
}
void EPD4INC::Buf_DrawBox(byte x, int y, int w, int h)
{

  for (int i = x; i < x + h; i++)
  {
    Buf_Buf_DrawXline( y, y + w - 1,  i);
  }

}
void EPD4INC::Buf_DrawEmptyBox(int x, int y, int w, int h)
{
  Buf_Buf_DrawXline(y, y + w, x);
  Buf_Buf_DrawXline(y, y + w, x + h);
  Buf_Buf_DrawYline(x, x + w, y);
  Buf_Buf_DrawYline(x, x + w, y + w);
}
void EPD4INC::Buf_UpdateFull( uint16_t mode)
{
  //int EPD4INC::EPD_Update_Full( uint16_t checker_size, uint16_t mode, const uint8_t *picimage)

  EPD_Update_Full((XDOT * YDOT / 8), S1D13541_LD_IMG_1BPP, EPDbuffer);
 // EPD_UpdateUser(mode, UPDATE_FULL, NULL);
}
//更新缓存区域数据到显示屏并更新
//注意，X Y 需要是8的整数倍地址 否则无效
void EPD4INC::Buf_Update_PartArea(int x, int y, int w, int h, uint16_t mode)
{
  unsigned char partbuf[(w / 8 + 1) * (h / 8 + 1)];
  int xtemp, ytemp, i = 0;
  if ((x % 8) || (y % 8))
    return ;
  for (ytemp = 0; ytemp < (h / 8 + 1); ytemp++)
  {
  }

}
//测试有问题 
void EPD4INC::Buf_drawXbm(int16_t xMove, int16_t yMove, int16_t width, int16_t height, unsigned char *xbm) {
  int16_t heightInXbm = (height + 7) / 8;
  uint8_t Data;
  //外部变量
  int16_t fontscale = 1;
  int16_t CurrentCursor = 0;
  //
  //  for(int16_t x = 0; x < width; x++) {
  //    for(int16_t y = 0; y < height; y++ ) {
  //      if (y & 7) {
  //        Data <<= 1; // Move a bit
  //      } else {  // Read new Data every 8 bit
  //        Data = xbm[(y / 8) + x * heightInXbm];
  //      }
  //      // if there is a bit draw it
  //      if (((Data & 0x80)>>7)) {
  //       if(fontscale==1) {Buf_SetPix(xMove + y, yMove + x);CurrentCursor=x;}
  //       if(fontscale==2) {Buf_SetPix(xMove + y*2, yMove + x*2);Buf_SetPix(xMove + y*2+1, yMove + x*2);Buf_SetPix(xMove + y*2, yMove + x*2+1);Buf_SetPix(xMove + y*2+1, yMove + x*2+1);CurrentCursor=x*2;}
  //       //if(fontscale==2) {SetPixel(xMove + y*2, yMove + x*2);CurrentCursor=x*2;}
  //      }
  //    }
  //  }
  for (int16_t y = 0; y < height; y++) {
    
    for (int16_t x = 0; x < width; x++)
    {

      if(((xbm[(y*width+x)/8])>>((y*width+x)%8))==0x01)
          Buf_SetPix(x+xMove,yMove+y);

 

    }
  }

}
